
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВывестиНовыеЭлементыНаФорму(ЭтотОбъект);
	
КонецПроцедуры 

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	
	ВывестиНовыеЭлементыНаФорму(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ВывестиНовыеЭлементыНаФорму(Форма)

	Если Форма.Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание") Тогда
		Форма.Элементы.ВКМ_СтоимостьЧасаРаботыСпециалиста.Видимость = Истина;
		Форма.Элементы.ВКМ_АбонентскаяПлата.Видимость = Истина;
		Форма.Элементы.ВКМ_ДатаНачалаДействия.Видимость = Истина;
		Форма.Элементы.ВКМ_ДатаОкончанияДействия.Видимость = Истина;
	Иначе
		Форма.Элементы.ВКМ_СтоимостьЧасаРаботыСпециалиста.Видимость = Ложь;
		Форма.Элементы.ВКМ_АбонентскаяПлата.Видимость = Ложь;
		Форма.Элементы.ВКМ_ДатаНачалаДействия.Видимость = Ложь;
		Форма.Элементы.ВКМ_ДатаОкончанияДействия.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

