#Область СлужебныеПроцедурыИФункции

Процедура ОтправкаУведомленияТелеграмБоту()Экспорт
	
	Выборка = Справочники.ВКМ_УведомленияТелеграмБоту.Выбрать();
	Пока Выборка.Следующий() Цикл
		ТекстСообщения = Выборка.Текст;
		ЕстьСвязь = Истина;
		ОтправитьСообщениеТелеграмБоту(ТекстСообщения, ЕстьСвязь); 
		Если ЕстьСвязь Тогда 
			Выборка.ПолучитьОбъект().Удалить();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ОтправитьСообщениеТелеграмБоту(ТекстСообщения,ЕстьСвязь) 
	
	ГруппаID = Константы.ВКМ_ИдентификаторГруппыОповещения.Получить(); 
	Токен = Константы.ВКМ_ТокенУправленияТелеграмБотом.Получить();
	
	Ресурс = "bot"+Токен+"/sendMessage?chat_id="+ГруппаID+"&text="+ТекстСообщения;
	
	Соединение = Новый HTTPСоединение("api.telegram.org",,,,,,Новый ЗащищенноеСоединениеOpenSSL);
	
	Запрос = Новый HTTPЗапрос(Ресурс); 
	Запрос.Заголовки.Вставить("Content-type","application/json"); 
	
	Ответ = Соединение.Получить(Запрос); 
	
	Если Ответ.КодСостояния <> 200 Тогда
		СтрокаОтвета = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации("HTTPСервисы.Ошибка",УровеньЖурналаРегистрации.Ошибка,,,СтрокаОтвета,);
		ЕстьСвязь = Ложь;
	КонецЕсли;
	
	ЗаписьЖурналаРегистрации("HTTPСервисы.Отправка",УровеньЖурналаРегистрации.Информация,,,"Сообщение отправлено",);
	
КонецПроцедуры

#КонецОбласти